grade_4b/app/views/plane_blueprints/_form.html.erb

SELECT  "backstage_props".* FROM "backstage_props" ORDER BY "backstage_props"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    <%= form.label "座舱图地址", for: :plane_blueprint_name %>
    <%= form.select :name, BackstageProp.get_the_only_prop.plane_types,id: :plane_blueprint_name, :prompt => 'Select One' %>