grade_4b/app/controllers/backstage_props_controller.rb

UPDATE "backstage_props" SET "plane_types" = ?, "updated_at" = ? WHERE "backstage_props"."id" = ?  [["plane_types", "---\n- A380\n- B777\n"], ["updated_at", "2018-05-13 08:16:29.414832"], ["id", 1]]
---
  def delete_plane_type
    set_backstage_prop

    logger.debug params[:plane_type]
    unless @backstage_prop.plane_types.present?
      @backstage_prop.plane_types = []
    end
    @backstage_prop.plane_types.delete(params[:plane_type])

    respond_to do |format|
      if @backstage_prop.save

SELECT  "backstage_props".* FROM "backstage_props" ORDER BY "backstage_props"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "backstage_props" LIMIT ?  [["LIMIT", 1]]
UPDATE "backstage_props" SET "plane_types" = ?, "updated_at" = ? WHERE "backstage_props"."id" = ?  [["plane_types", "---\n- A380\n"], ["updated_at", "2018-05-09 08:44:43.611269"], ["id", 1]]
---
  def update

    @modified_plane_type = params[:backstage_prop][:modified_plane_type]
    if @modified_plane_type.present?
      unless @backstage_prop.plane_types.present?
        @backstage_prop.plane_types = []
      end
      logger.debug @modified_plane_type
      @backstage_prop.plane_types.push(@modified_plane_type)

SELECT  "backstage_props".* FROM "backstage_props" WHERE "backstage_props"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_backstage_prop
    @backstage_prop = BackstageProp.find(params[:id])