grade_4b/app/controllers/plane_blueprints_controller.rb

  def index
    @plane_blueprints = PlaneBlueprint.all
---
SELECT "plane_blueprints".* FROM "plane_blueprints"