grade_4b/app/controllers/planes_controller.rb

  def index
    @planes = Plane.all
---
SELECT "planes".* FROM "planes"