grade_4b/app/controllers/prices_controller.rb

SELECT "prices".* FROM "prices"
---
  def index
    @prices = Price.all

UPDATE "prices" SET "price" = ?, "updated_at" = ? WHERE "prices"."id" = ?  [["price", 1000.0], ["updated_at", "2018-05-15 15:09:21.405624"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @price.update(price_params)

SELECT  "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_price
      @price = Price.find(params[:id])