grade_4b/DB Homework/app/views/flights/_form.html.erb

SELECT "planes"."id" FROM "planes" INNER JOIN "flights_planes" ON "planes"."id" = "flights_planes"."plane_id" WHERE "flights_planes"."flight_id" = ?  [["flight_id", 1]]
---
    <%= form.label "飞机型号", for: :flight_plane_ids %>
    <%= form.select :plane_ids, Plane.all.collect {|p| [ p['name'], p['id'] ] }, { :include_blank=> false, :include_hidden=> false}, {id: :flight_plane_ids, class: "form-control", :multiple => ""} %>

SELECT "prices".* FROM "prices" WHERE "prices"."flight_id" = ?  [["flight_id", 1]]
---
    <div class="btn-group" id="flight_prices" role="group" >
      <% @flight.prices.each do |price| %>