grade_4b/DB Homework/app/views/flights/show.html.erb

    <div class="list-group" id="flight_plane_ids">
      <% if @flight.planes.any? %>
---
SELECT  1 AS one FROM "planes" INNER JOIN "flights_planes" ON "planes"."id" = "flights_planes"."plane_id" WHERE "flights_planes"."flight_id" = ? LIMIT ?  [["flight_id", 9], ["LIMIT", 1]]
SELECT "planes"."id" FROM "planes" INNER JOIN "flights_planes" ON "planes"."id" = "flights_planes"."plane_id" WHERE "flights_planes"."flight_id" = ?  [["flight_id", 1]]

    <div class="list-group" id="flight_prices">
      <% @flight.prices.each do |price| %>
---
SELECT "prices".* FROM "prices" WHERE "prices"."flight_id" = ?  [["flight_id", 9]]

    <%= form.label "满座率", for: :flight_seat_fill_up_percentage %>
    <input class="form-control" id="flight_seat_fill_up_percentage" value="<%= @flight.tickets.count %> / <%= @flight.planes.first.size %> = <%= @flight.tickets.count.to_f / @flight.planes.first.size.to_f * 100.0 %>%">
---
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."flight_id" = ?  [["flight_id", 1]]