grade_4b/DB Homework/app/views/analytics/index.html.erb

      <td><%= ticket.user.name %></td>
      <td><%= ticket.flight_id.present?? ticket.flight.name : "" %></td>
      <td><%= ticket.real_price %></td>
      <td><%= ticket.price_id.present?? ticket.price.price : "" %></td>
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]