grade_4b/DB Homework/app/views/planes/_form.html.erb

    <%= form.label "班机型号", for: :plane_plane_blueprint_id %>
    <%= form.select :plane_blueprint_id , PlaneBlueprint.all.collect {|p| [ p['name'], p['id'] ] }, {}, {id: :plane_plane_blueprint_id, class: "form-control"} %>
---
SELECT "plane_blueprints".* FROM "plane_blueprints"