grade_4b/DB Homework/app/views/planes/show.html.erb

SELECT "plane_blueprints".* FROM "plane_blueprints"
---
        <%= form.label "班机型号", for: :plane_plane_blueprint_id %>
        <%= form.select :plane_blueprint_id, PlaneBlueprint.all.collect {|p| [p['name'], p['id']]}, {}, {id: :plane_plane_blueprint_id, class: "form-control", :disabled => ""} %>

SELECT "flights".* FROM "flights" INNER JOIN "flights_planes" ON "flights"."id" = "flights_planes"."flight_id" WHERE "flights_planes"."plane_id" = ?  [["plane_id", 1]]
---
          <div class="list-group">
            <% @plane.flights.each do |flight| %>