grade_4b/DB Homework/app/controllers/analytics_controller.rb

SELECT "tickets".* FROM "tickets" WHERE (created_at < '2018-05-04') AND (created_at > '2018-05-16')
SELECT "tickets".* FROM "tickets"
---
  def index

    logger.debug params
    if params[:begin_time].present? && params[:end_time].present?
      @tickets = Ticket.where("created_at < ?", params[:end_time]).where("created_at > ?", params[:begin_time])
      @begin_time = params[:begin_time]
      @end_time = params[:end_time]
    else
      @tickets = Ticket.all