grade_4b/DB Homework/app/controllers/flights_controller.rb

  def create
    logger.debug params
    logger.debug flight_params

    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("name", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "中国航空 41512"], ["number", "CZ41512"], ["created_at", "2018-05-13 18:36:07.097521"], ["updated_at", "2018-05-13 18:36:07.097521"]]

  def update
    keep_prices_present(@flight)
    logger.debug params
    logger.debug flight_params
    respond_to do |format|
      if @flight.update(flight_params)
---
UPDATE "flights" SET "begintime" = ?, "endtime" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["begintime", "2000-01-01 04:39:00"], ["endtime", "2000-01-01 04:39:00"], ["updated_at", "2018-05-13 20:39:47.965309"], ["id", 1]]