grade_4b/DB Homework/app/controllers/planes_controller.rb

  def index
    @planes = Plane.all
---
SELECT "planes".* FROM "planes"

  def create
    @plane = Plane.new(plane_params)

    respond_to do |format|
      if @plane.save
---
INSERT INTO "planes" ("name", "size", "created_at", "updated_at", "plane_blueprint_id") VALUES (?, ?, ?, ?, ?)  [["name", "国航 A380"], ["size", 240], ["created_at", "2018-05-13 15:13:45.643689"], ["updated_at", "2018-05-13 15:13:45.643689"], ["plane_blueprint_id", 1]]

  def update
    respond_to do |format|
      if @plane.update(plane_params)
---
UPDATE "planes" SET "name" = ?, "updated_at" = ? WHERE "planes"."id" = ?  [["name", "国航 A380-1"], ["updated_at", "2018-05-13 18:06:07.264040"], ["id", 1]]

    def set_plane
      @plane = Plane.find(params[:id])
---
SELECT  "planes".* FROM "planes" WHERE "planes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]