grade_4b/DB Homework/app/controllers/plane_blueprints_controller.rb

SELECT "plane_blueprints".* FROM "plane_blueprints"
---
  def index
    @plane_blueprints = PlaneBlueprint.all

INSERT INTO "plane_blueprints" ("seat_map", "created_at", "updated_at") VALUES (?, ?, ?)  [["seat_map", ""], ["created_at", "2018-05-13 08:55:55.235657"], ["updated_at", "2018-05-13 08:55:55.235657"]]
---
  def create
    @plane_blueprint = PlaneBlueprint.new(plane_blueprint_params)

    respond_to do |format|
      if @plane_blueprint.save

UPDATE "plane_blueprints" SET "description" = ?, "updated_at" = ? WHERE "plane_blueprints"."id" = ?  [["description", "空中客车A380是空中客车公司研发的双层4发动机巨型客机。该型号的原型机于2004年中首次亮相。首架A380客机于2005年1月18日在图卢兹厂房举行出厂典礼，并于4月27日试飞成功。同年11月11日，客机首次跨洲试飞抵达亚洲的新加坡。"], ["updated_at", "2018-05-13 17:56:04.837829"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @plane_blueprint.update(plane_blueprint_params)

SELECT  "plane_blueprints".* FROM "plane_blueprints" WHERE "plane_blueprints"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_plane_blueprint
      @plane_blueprint = PlaneBlueprint.find(params[:id])