grade_4b/DB Homework/app/controllers/tickets_controller.rb

SELECT  "prices".* FROM "prices" WHERE "prices"."flight_id" = ? AND "prices"."seat_level" = ? ORDER BY "prices"."id" ASC LIMIT ?  [["flight_id", 1], ["seat_level", "0"], ["LIMIT", 1]]
INSERT INTO "tickets" ("user_id", "flight_id", "created_at", "updated_at", "price_id", "real_price", "pay_status") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 2], ["flight_id", 3], ["created_at", "2018-05-16 05:27:40.401189"], ["updated_at", "2018-05-16 05:27:40.401189"], ["price_id", 16], ["real_price", 800.0], ["pay_status", 0]]
---
  def create
    @ticket = Ticket.new(ticket_params)
    @ticket.price_id = Price.where(:flight_id => @ticket.flight_id,seat_level: params[:ticket][:seat_level]).first.id
    @ticket.save

UPDATE "tickets" SET "real_price" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["real_price", 700.0], ["updated_at", "2018-05-15 11:27:13.313153"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @ticket.update(ticket_params)