grade_4b/DB Homework/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at", "sex_type") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Peadar Lurz"], ["email", "TheLackingGamer@gmail.com"], ["password", "123456"], ["created_at", "2018-05-15 06:24:24.151415"], ["updated_at", "2018-05-15 06:24:24.151415"], ["sex_type", 0]]