grade_4b/app/views/tickets/_form.html.erb

SELECT "flights".* FROM "flights"
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "prices".* FROM "prices" WHERE "prices"."flight_id" = ? ORDER BY "prices"."id" ASC LIMIT ?  [["flight_id", 1], ["LIMIT", 1]]
---
    <%= form.label "座舱等级", for: :ticket_price_id %>
    <% if ticket.flight_id.present? %>
      <%= form.select :price_id, ticket.flight.prices.collect{|p| [Price.seat_level_names[Price.seat_levels[p['seat_level']]], p['id']]}, {}, {id: :ticket_price_id, class: "form-control"} %>

SELECT "users".* FROM "users"
---
    <%= form.label "用户", for: :ticket_user_id %>
    <%= form.select :user_id, User.all.collect {|p| [p['name'], p['id']]}, {}, {id: :ticket_user_id, class: "form-control"} %>