grade_4b/app/views/tickets/index.html.erb

      <td><%= ticket.user.name %></td>
      <td><%= ticket.flight_id.present?? ticket.flight.name : "" %></td>
      <td><%= ticket.real_price %></td>
      <td><%= ticket.price_id.present?? ticket.price.price : "" %></td>
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]