grade_4b/DB Homework/app/views/plane_blueprints/show.html.erb

        <%= form.label "飞机型号", for: :plane_blueprint_name %>
        <%= form.select :name, BackstageProp.get_the_only_prop.plane_types, {}, {id: :plane_blueprint_name, class: "form-control", :prompt => 'Select One', :disabled => ""} %>
---
SELECT  "backstage_props".* FROM "backstage_props" ORDER BY "backstage_props"."id" ASC LIMIT ?  [["LIMIT", 1]]